commit a6c3a2a210729c9c2a07fdfc366c353b5e3dd305
Author: Greg Kroah-Hartman <gregkh@linuxfoundation.org>
Date:   Thu Feb 22 15:40:12 2018 +0100

    Linux 4.15.5

commit b5d3e87c07505d64631662c2caffcf054c9a13cf
Author: yinbo.zhu <yinbo.zhu@nxp.com>
Date:   Fri Dec 1 15:09:34 2017 +0800

    mmc: sdhci-of-esdhc: fix the mmc error after sleep on ls1046ardb
    
    commit f2bc600008bd6f7f5d0b6b56238d14f95cd454d2 upstream.
    
    When system wakes up from sleep on ls1046ardb, the SD operation fails
    with mmc error messages since ESDHC_TB_EN bit couldn't be cleaned by
    eSDHC_SYSCTL[RSTA]. It's proper to clean this bit in esdhc_reset()
    rather than in probe.
    
    Signed-off-by: yinbo.zhu <yinbo.zhu@nxp.com>
    Acked-by: Yangbo Lu <yangbo.lu@nxp.com>
    Acked-by: Adrian Hunter <adrian.hunter@intel.com>
    Signed-off-by: Ulf Hansson <ulf.hansson@linaro.org>
    Cc: Rasmus Villemoes <rasmus.villemoes@prevas.dk>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit 772b28fb3f5dde45186482c181acb5be861deb83
Author: yinbo.zhu <yinbo.zhu@nxp.com>
Date:   Wed Nov 8 17:09:50 2017 +0800

    mmc: sdhci-of-esdhc: fix eMMC couldn't work after kexec
    
    commit 97618aca1440b5addc5c3d78659d3e176be23b80 upstream.
    
    The bit eSDHC_TBCTL[TB_EN] couldn't be reset by eSDHC_SYSCTL[RSTA] which is
    used to reset for all. The driver should make sure it's cleared before card
    initialization, otherwise the initialization would fail.
    

        -lpthread seccomp_bpf.c -o seccomp_bpf
    seccomp_bpf.c: In function 'tracer_ptrace':
    seccomp_bpf.c:1720:12: error: '__NR_open' undeclared
        (first use in this function)
      if (nr == __NR_open)
                ^~~~~~~~~
    seccomp_bpf.c:1720:12: note: each undeclared identifier is reported
        only once for each function it appears in
    In file included from seccomp_bpf.c:48:0:
    seccomp_bpf.c: In function 'TRACE_syscall_ptrace_syscall_dropped':
    seccomp_bpf.c:1795:39: error: '__NR_open' undeclared
        (first use in this function)
      EXPECT_SYSCALL_RETURN(EPERM, syscall(__NR_open));
                                           ^
    open(2) is a legacy syscall, replaced with openat(2) since 2.6.16.
    Thus new architectures in the kernel, such as arm64, don't implement
    these legacy syscalls.
    
    Fixes: a33b2d0359a0 ("selftests/seccomp: Add tests for basic ptrace actions")
    Signed-off-by: Anders Roxell <anders.roxell@linaro.org>
    Tested-by: Naresh Kamboju <naresh.kamboju@linaro.org>
    Cc: stable@vger.kernel.org
    Acked-by: Kees Cook <keescook@chromium.org>
    Signed-off-by: Shuah Khan <shuahkh@osg.samsung.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit e42e049c0248f79284f84c221b1d8f3882dac58e
Author: Michael J. Ruhl <michael.j.ruhl@intel.com>
Date:   Thu Feb 1 12:31:06 2018 -0800

    IB/core: Avoid a potential OOPs for an unused optional parameter
    
    commit 2ff124d597c2df8696169ce0006fc974c49a4569 upstream.
    
    The ev_file is an optional parameter for CQ creation. If the parameter
    is not passed, the ev_file pointer will be NULL.  Using that pointer
    to set the cq_context will result in an OOPs.
    
    Verify that ev_file is not NULL before using.
    
    Cc: <stable@vger.kernel.org> # 4.14.x
    Fixes: 9ee79fce3642 ("IB/core: Add completion queue (cq) object actions")
    Reviewed-by: Dennis Dalessandro <dennis.dalessandro@intel.com>
    Reviewed-by: Ira Weiny <ira.weiny@intel.com>
    Signed-off-by: Michael J. Ruhl <michael.j.ruhl@intel.com>
    Signed-off-by: Dennis Dalessandro <dennis.dalessandro@intel.com>
    Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit e9e368446931b7ee76fb51a2eb0515454fb9055d
Author: Bodong Wang <bodong@mellanox.com>
Date:   Fri Jan 12 07:58:41 2018 +0200

    IB/core: Fix ib_wc structure size to remain in 64 bytes boundary
    
    commit cd2a6e7d384b043d5d029e39663061cebc949385 upstream.
    
    The change of slid from u16 to u32 results in sizeof(struct ib_wc)
    cross 64B boundary, which causes more cache misses. This patch
    rearranges the fields and remain the size to 64B.
    
    Pahole output before this change:
    
    struct ib_wc {
            union {
                    u64                wr_id;                /*           8 */
                    struct ib_cqe *    wr_cqe;               /*           8 */
            };                                               /*     0     8 */
            enum ib_wc_status          status;               /*     8     4 */
            enum ib_wc_opcode          opcode;               /*    12     4 */
            u32                        vendor_err;           /*    16     4 */
            u32                        byte_len;             /*    20     4 */
            struct ib_qp *             qp;                   /*    24     8 */
            union {
                    __be32             imm_data;             /*           4 */
                    u32                invalidate_rkey;      /*           4 */
            } ex;                                            /*    32     4 */
            u32                        src_qp;               /*    36     4 */
            int                        wc_flags;             /*    40     4 */
            u16                        pkey_index;           /*    44     2 */
    
            /* XXX 2 bytes hole, try to pack */
    
            u32                        slid;                 /*    48     4 */
            u8                         sl;                   /*    52     1 */
            u8                         dlid_path_bits;       /*    53     1 */
            u8                         port_num;             /*    54     1 */
            u8                         smac[6];              /*    55     6 */
    
            /* XXX 1 byte hole, try to pack */
    
            u16                        vlan_id;              /*    62     2 */
            /* --- cacheline 1 boundary (64 bytes) --- */
            u8                         network_hdr_type;     /*    64     1 */
    
            /* size: 72, cachelines: 2, members: 17 */
            /* sum members: 62, holes: 2, sum holes: 3 */
            /* padding: 7 */
            /* last cacheline: 8 bytes */
    };
    
    Pahole output after this change:
    
    struct ib_wc {
            union {
                    u64                wr_id;                /*           8 */
                    struct ib_cqe *    wr_cqe;               /*           8 */
            };                                               /*     0     8 */
            enum ib_wc_status          status;               /*     8     4 */
            enum ib_wc_opcode          opcode;               /*    12     4 */
            u32                        vendor_err;           /*    16     4 */
            u32                        byte_len;             /*    20     4 */
            struct ib_qp *             qp;                   /*    24     8 */
            union {
                    __be32             imm_data;             /*           4 */
                    u32                invalidate_rkey;      /*           4 */
            } ex;                                            /*    32     4 */
            u32                        src_qp;               /*    36     4 */
            u32                        slid;                 /*    40     4 */
            int                        wc_flags;             /*    44     4 */
            u16                        pkey_index;           /*    48     2 */
            u8                         sl;                   /*    50     1 */
            u8                         dlid_path_bits;       /*    51     1 */
            u8                         port_num;             /*    52     1 */
            u8                         smac[6];              /*    53     6 */
    
            /* XXX 1 byte hole, try to pack */
    
            u16                        vlan_id;              /*    60     2 */
            u8                         network_hdr_type;     /*    62     1 */
    
            /* size: 64, cachelines: 1, members: 17 */
            /* sum members: 62, holes: 1, sum holes: 1 */
            /* padding: 1 */
    };
    
    Fixes: 7db20ecd1d97 ("IB/core: Change wc.slid from 16 to 32 bits")
    Signed-off-by: Bodong Wang <bodong@mellanox.com>
    Reviewed-by: Parav Pandit <parav@mellanox.com>
    Signed-off-by: Leon Romanovsky <leon@kernel.org>
    Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit 17890e8494f271235e1eaf177ebfca35fca97a34
Author: Bart Van Assche <bvanassche@acm.org>
Date:   Wed Jan 3 13:28:18 2018 -0800

    IB/core: Fix two kernel warnings triggered by rxe registration
    
    commit 02ee9da347873699603d9ce0112a80b5dd69dea1 upstream.
    
    Eliminate the WARN_ONs that create following two warnings when
    registering an rxe device:
    
