commit d795d7b5846cb98eaa66abeb2b0927499ede2af5
Author: Greg Kroah-Hartman <gregkh@linuxfoundation.org>
Date:   Wed May 12 08:40:05 2021 +0200

    Linux 5.12.3
    
    Tested-by: Jon Hunter <jonathanh@nvidia.com>
    Reviewed-by: Florian Fainelli <f.fainelli@gmail.com>
    Tested-by: Linux Kernel Functional Testing <lkft@linaro.org>
    Tested-by: Fox Chen <foxhlchen@gmail.com>
    Tested-by: Guenter Roeck <linux@roeck-us.net>
    Tested-by: Jason Self <jason@bluehome.net>
    Tested-by: Shuah Khan <skhan@linuxfoundation.org>
    Tested-by: Justin M. Forbes <jforbes@fedoraproject.org>
    Link: https://lore.kernel.org/r/20210510102014.849075526@linuxfoundation.org
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit 142703b82c36834a286ce667ce20f714577b8ced
Author: Lukasz Luba <lukasz.luba@arm.com>
Date:   Thu Apr 22 16:36:22 2021 +0100

    thermal/core/fair share: Lock the thermal zone while looping over instances
    
    commit fef05776eb02238dcad8d5514e666a42572c3f32 upstream.
    
    The tz->lock must be hold during the looping over the instances in that
    thermal zone. This lock was missing in the governor code since the
    beginning, so it's hard to point into a particular commit.
    
    CC: stable@vger.kernel.org # 4.4+
    Signed-off-by: Lukasz Luba <lukasz.luba@arm.com>
    Signed-off-by: Daniel Lezcano <daniel.lezcano@linaro.org>
    Link: https://lore.kernel.org/r/20210422153624.6074-2-lukasz.luba@arm.com

    scsi: lpfc: Fix crash when a REG_RPI mailbox fails triggering a LOGO response
    
    [ Upstream commit fffd18ec6579c2d9c72b212169259062fe747888 ]
    
    Fix a crash caused by a double put on the node when the driver completed an
    ACC for an unsolicted abort on the same node.  The second put was executed
    by lpfc_nlp_not_used() and is wrong because the completion routine executes
    the nlp_put when the iocbq was released.  Additionally, the driver is
    issuing a LOGO then immediately calls lpfc_nlp_set_state to put the node
    into NPR.  This call does nothing.
    
    Remove the lpfc_nlp_not_used call and additional set_state in the
    completion routine.  Remove the lpfc_nlp_set_state post issue_logo.  Isn't
    necessary.
    
    Link: https://lore.kernel.org/r/20210412013127.2387-3-jsmart2021@gmail.com
    Co-developed-by: Justin Tee <justin.tee@broadcom.com>
    Signed-off-by: Justin Tee <justin.tee@broadcom.com>
    Signed-off-by: James Smart <jsmart2021@gmail.com>
    Signed-off-by: Martin K. Petersen <martin.petersen@oracle.com>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit a8655bfe7ba6d1a289ce7252af4919937ddbfc0a
Author: Gustavo A. R. Silva <gustavoars@kernel.org>
Date:   Thu Apr 1 11:20:54 2021 -0500

    scsi: mpt3sas: Fix out-of-bounds warnings in _ctl_addnl_diag_query
    
    [ Upstream commit 16660db3fc2af8664af5e0a3cac69c4a54bfb794 ]
    
    Fix the following out-of-bounds warnings by embedding existing struct
    htb_rel_query into struct mpt3_addnl_diag_query, instead of duplicating its
    members:
    
    include/linux/fortify-string.h:20:29: warning: '__builtin_memcpy' offset [19, 32] from the object at 'karg' is out of the bounds of referenced subobject 'buffer_rel_condition' with type 'short unsigned int' at offset 16 [-Warray-bounds]
    include/linux/fortify-string.h:22:29: warning: '__builtin_memset' offset [19, 32] from the object at 'karg' is out of the bounds of referenced subobject 'buffer_rel_condition' with type 'short unsigned int' at offset 16 [-Warray-bounds]
    
    The problem is that the original code is trying to copy data into a bunch
    of struct members adjacent to each other in a single call to memcpy(). All
    those members are exactly the same contained in struct htb_rel_query, so
    instead of duplicating them into struct mpt3_addnl_diag_query, replace them
    with new member rel_query of type struct htb_rel_query. So, now that this
    new object is introduced, memcpy() doesn't overrun the length of
    &karg.buffer_rel_condition, because the address of the new struct object
    _rel_query_ is used as destination, instead. The same issue is present when
    calling memset(), and it is fixed with this same approach.
    
    Below is a comparison of struct mpt3_addnl_diag_query, before and after
    this change (the size and cachelines remain the same):
    
    $ pahole -C mpt3_addnl_diag_query drivers/scsi/mpt3sas/mpt3sas_ctl.o
    struct mpt3_addnl_diag_query {
            struct mpt3_ioctl_header   hdr;                  /*     0    12 */
            uint32_t                   unique_id;            /*    12     4 */
            uint16_t                   buffer_rel_condition; /*    16     2 */
            uint16_t                   reserved1;            /*    18     2 */
            uint32_t                   trigger_type;         /*    20     4 */
            uint32_t                   trigger_info_dwords[2]; /*    24     8 */
            uint32_t                   reserved2[2];         /*    32     8 */
    
            /* size: 40, cachelines: 1, members: 7 */
            /* last cacheline: 40 bytes */
    };
    
    $ pahole -C mpt3_addnl_diag_query drivers/scsi/mpt3sas/mpt3sas_ctl.o
    struct mpt3_addnl_diag_query {
            struct mpt3_ioctl_header   hdr;                  /*     0    12 */
            uint32_t                   unique_id;            /*    12     4 */
            struct htb_rel_query       rel_query;            /*    16    16 */
            uint32_t                   reserved2[2];         /*    32     8 */
    
            /* size: 40, cachelines: 1, members: 4 */
            /* last cacheline: 40 bytes */
    };
    
    Also, this helps with the ongoing efforts to globally enable -Warray-bounds
    and get us closer to being able to tighten the FORTIFY_SOURCE routines on
    memcpy().
    
    Link: https://github.com/KSPP/linux/issues/109
    Link: https://lore.kernel.org/lkml/60659889.bJJILx2THu3hlpxW%25lkp@intel.com/
    Link: https://lore.kernel.org/r/20210401162054.GA397186@embeddedor
    Build-tested-by: kernel test robot <lkp@intel.com>
    Reported-by: kernel test robot <lkp@intel.com>
    Signed-off-by: Gustavo A. R. Silva <gustavoars@kernel.org>
    Signed-off-by: Martin K. Petersen <martin.petersen@oracle.com>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 1fa8aea88a39ee22c7d962bbd56eb545667fcc3e
Author: Joshua Aberback <joshua.aberback@amd.com>
Date:   Tue Apr 6 17:21:50 2021 -0400

    drm/amd/display: Update DCN302 SR Exit Latency
